In [18]:
import numpy as np
import pandas as pd


import os

os.getcwd()

os.chdir("G:\Quant finance\esg")

In [21]:
Emission_data = pd.read_csv("Emissions_data.csv")
Emission_data.head()
Emission_data.shape

(20853, 4)

In [13]:
print(Emission_data.isnull().sum())
Emission_data.describe()

Entity                               0
Code                              2207
Year                                 0
Annual CO₂ emissions (tonnes )       0
dtype: int64

               Year  Annual CO₂ emissions (tonnes )
count  20853.000000                    2.085300e+04
mean    1953.339424                    1.930517e+08
std       57.903089                    1.345143e+09
min     1751.000000                   -6.255223e+08
25%     1932.000000                    3.187680e+05
50%     1971.000000                    3.828880e+06
75%     1995.000000                    3.706898e+07
max     2017.000000                    3.615326e+10

In [22]:
#Emission_data[Emission_data.isnull()]
Emission_data.head()
Emission_data[Emission_data.Code.isnull()==True]

                          Entity Code  Year  Annual CO₂ emissions (tonnes )
69                        Africa  NaN  1751                            0.00
70                        Africa  NaN  1752                            0.00
71                        Africa  NaN  1753                            0.00
72                        Africa  NaN  1754                            0.00
73                        Africa  NaN  1755                            0.00
...                          ...  ...   ...                             ...
20348  Wallis and Futuna Islands  NaN  2013                        21984.00
20349  Wallis and Futuna Islands  NaN  2014                        21984.00
20350  Wallis and Futuna Islands  NaN  2015                        23990.58
20351  Wallis and Futuna Islands  NaN  2016                        24265.49
20352  Wallis and Futuna Islands  NaN  2017                        25909.08

[2207 rows x 4 columns]